===============================
num
===============================

1
5

---

(program
  (num)
  (num)
)

===============================
num_seq simple
===============================

1..5
10..5000

---

(program
  (num_seq
    (num)
    (num)
  )
  (num_seq
    (num)
    (num)
  )
)

===============================
num_seq open ended
===============================

       ..1



..1..10..


10..  

---

(program
  (num_seq
    (inf)
    (num)
  )
  (num_seq
    (inf)
    (num)
    (num)
    (inf)
  )
  (num_seq
    (num)
    (inf)
  )
)

===============================
num_seq mix
===============================

1 ..1 1..10 ..10 1..56..110..300..500 ..10000

---

(program
  (num)
  (num_seq
    (inf)
    (num)
  )
  (num_seq
    (num)
    (num)
  )
  (num_seq
    (inf)
    (num)
  )
  (num_seq
    (num)
    (num)
    (num)
    (num)
    (num)
  )
  (num_seq
    (inf)
    (num)
  )
)
